
import { Link } from "react-router-dom";

const PrivacyPolicy = () => {
  return (
    <div className="container mt-5">
      <div className="row justify-content-center">
        <div className="col-md-8">
          <h1 className="text-center mb-4">นโยบายความเป็นส่วนตัว</h1>

          <p>
            เราให้ความสำคัญกับการคุ้มครองข้อมูลส่วนบุคคลของคุณ โดยเราจะเก็บข้อมูลที่คุณให้มาอย่างปลอดภัย และใช้ข้อมูลเหล่านี้ตามนโยบายที่กำหนดไว้ดังนี้:
          </p>

          <h2>1. ข้อมูลที่เรารวบรวม</h2>
          <p>
            เราจะเก็บข้อมูลที่คุณให้มาเมื่อคุณลงทะเบียนหรือสมัครสมาชิกในเว็บไซต์ของเรา ข้อมูลที่เรารวบรวมมีดังนี้:
          </p>
          <ul>
            <li>ข้อมูลส่วนบุคคล เช่น ชื่อ, นามสกุล, วันเกิด, และข้อมูลติดต่อ</li>
            <li>ข้อมูลเกี่ยวกับบัญชีผู้ใช้ เช่น อีเมล, ชื่อผู้ใช้, รหัสผ่าน</li>
            <li>ข้อมูลรูปภาพ เช่น รูปถ่ายบัตรประชาชนหรือเอกสารสำคัญอื่นๆ</li>
          </ul>

          <h2>2. วิธีการใช้ข้อมูล</h2>
          <p>
            ข้อมูลที่เรารวบรวมจะถูกนำไปใช้ในทางต่อไปนี้:
          </p>
          <ul>
            <li>การยืนยันตัวตนของผู้ใช้เพื่อให้มั่นใจว่ามีการใช้บริการที่ปลอดภัย</li>
            <li>การติดต่อหรือการแจ้งข้อมูลที่เกี่ยวข้องกับการใช้บริการของเว็บไซต์</li>
            <li>การวิเคราะห์และพัฒนาบริการของเราเพื่อให้ผู้ใช้ได้รับประสบการณ์ที่ดีที่สุด</li>
          </ul>

          <h2>3. การปกป้องข้อมูล</h2>
          <p>
            เรามีมาตรการในการปกป้องข้อมูลของคุณให้ปลอดภัย โดยใช้เทคโนโลยีการเข้ารหัส (Encryption) และระบบรักษาความปลอดภัยที่เหมาะสม
          </p>

          <h2>4. การแชร์ข้อมูล</h2>
          <p>
            เราจะไม่เปิดเผยข้อมูลส่วนบุคคลของคุณแก่บุคคลที่สาม ยกเว้นในกรณีต่อไปนี้:
          </p>
          <ul>
            <li>ตามคำสั่งของกฎหมายหรือคำร้องจากหน่วยงานที่มีอำนาจ</li>
            <li>ในกรณีที่เราต้องการปกป้องสิทธิ์หรือความปลอดภัยของเรา</li>
          </ul>

          <h2>5. การเก็บรักษาข้อมูล</h2>
          <p>
            ข้อมูลส่วนบุคคลของคุณจะถูกเก็บรักษาไว้ตามระยะเวลาที่จำเป็นเท่านั้น และจะถูกลบออกเมื่อไม่มีความจำเป็นในการใช้งาน
          </p>

          <h2>6. สิทธิของผู้ใช้</h2>
          <p>
            คุณมีสิทธิ์ในการเข้าถึง, แก้ไข, หรือขอลบข้อมูลส่วนบุคคลของคุณจากระบบของเรา หากต้องการทำเช่นนั้น โปรดติดต่อเราที่ <h5 className="custom-topic">CardleHelp@gmail.com</h5>.
          </p>

          <h2>7. การยอมรับนโยบายความเป็นส่วนตัว</h2>
          <p>
            โดยการใช้งานเว็บไซต์ของเรา คุณยอมรับการเก็บและใช้ข้อมูลส่วนบุคคลตามนโยบายนี้ หากคุณไม่ยอมรับโปรดหยุดการใช้งานเว็บไซต์ของเรา
          </p>

          <div className="text-center mb-5">
            <Link to="/signup" className="btn btn-dark mt-4">กลับสู่หน้าแรก</Link>
          </div>
        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicy;
